## **ETL in Python with SQL Server**

Aim: texttttttttttttttttttttttttttttttttt

In [34]:
# Importing dependencies 
import pandas as pd
import pyodbc

In [35]:
# "Copyright Mattithyahu 2021-%s" % ("Ongoing")
# Format must be within the same parantheses or function call will not work 

# Example

# "Hello %s, my last name is %s" % ('john', 'doe') # Hello john, my last name is doe".If you are using ints instead of string, use %d instead of %s.
# "My name is %s and i'm %d" % ('john doe', 12) #My name is john doe and i'm 12

In [36]:
# Reading csv to dataframe
df = pd.read_csv('../Data/data.txt')

# Viewing dataset
df

  Gender  Age  Name
0      M   20  Mike
1      F   54  Lara

In [37]:
# SQL Server ETL
df = pd.read_csv('../Data/data.txt')

# Establishing server connection
def ETL1(Server,db):
    """
    SQL Server Database Server name
    SQL Server Database name
    Database table name
    
    """
    
    conn = pyodbc.connect('Driver={SQL Server};'
                        'Server=%s;' 
                        'Database=%s;' 
                        'Trusted_Connection=yes;'
                        % (Server,db))
    cursor = conn.cursor()

# Creating SQL table and loading data
def ETL2(tablename):
    cursor.execute('''
            CREATE TABLE %s (
                Gender varchar(50),
                Age int,
                Name varchar(50)
                )
                '''% (tablename))

    # Insert DataFrame to Table
    for row in df.itertuples():
        cursor.execute('''
                    INSERT INTO %s (Gender, Age, Name)
                    VALUES (?,?,?)
                    ''' % (tablename),
                    row.Gender,
                    row.Age,
                    row.Name
                    )
    conn.commit()

In [ ]:
ETL1('{ENTER SERVERNAME}','{ENTER DATABASENAME}')
ETL2('{ENTER TABLENAME}')